app/controllers/pins_controller.rb

	def index
		if params[:category].blank?
			@pins = Pin.all.order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "pins".* FROM "pins"  ORDER BY created_at DESC

	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)